xrun(64): 22.03-s001: (c) Copyright 1995-2022 Cadence Design Systems, Inc.
TOOL:	xrun(64)	22.03-s001: Started on Nov 13, 2025 at 21:21:27 MSK
xrun
	-r tb_gpt_opt
	-64bit
	-xmlibdirpath /home/Stepan/General-Purpose-Timers/build/work
	-seed 29816
	-l /home/Stepan/General-Purpose-Timers/build/run.log
	-input xlm.tcl
	-input @run
	-gui
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
SVSEED set from command line: 29816
xmsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
xmsim: *E,IONOEN: file does not exist, xlm.tcl.

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /local/tools/cadence/XCELIUM/22.03/tools/xcelium/files/xmsimrc
xcelium> run
xmsim: *W,OLDURR: The default algorithm for $urandom_range and randcase is used. It can have distribution problems..
Simulation interrupted at 1268214975 NS + 1
xcelium> database -open waves -into waves.shm -default
Created default SHM database waves
xcelium> probe -create -shm tb_gpt.aclk tb_gpt.aresetn tb_gpt.ch_i tb_gpt.ch_o tb_gpt.etr_i tb_gpt.gpt_hwif_in tb_gpt.itr_i tb_gpt.trg_o
Created probe 1
xcelium> reset
SVSEED set from command line: 29816
xmsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
Loaded snapshot worklib.tb_gpt_opt:sv
xcelium> run
Simulation interrupted at 74813915 NS + 0
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	22.03-s001: Exiting on Nov 13, 2025 at 21:23:11 MSK  (total: 00:01:44)
